ceph/2hdd/rbdxfs_i01.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 4 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randread: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)
64k_read: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=6002: Mon Aug 17 14:53:17 2020
  write: IOPS=425, BW=1700KiB/s (1741kB/s)(49.8MiB/30001msec)
    slat (nsec): min=9314, max=62590, avg=20123.76, stdev=3136.16
    clat (usec): min=1151, max=272872, avg=2328.49, stdev=2423.96
     lat (usec): min=1172, max=272892, avg=2348.98, stdev=2423.97
    clat percentiles (usec):
     |  1.00th=[ 1647],  5.00th=[ 1844], 10.00th=[ 1958], 20.00th=[ 2089],
     | 30.00th=[ 2147], 40.00th=[ 2212], 50.00th=[ 2278], 60.00th=[ 2343],
     | 70.00th=[ 2442], 80.00th=[ 2540], 90.00th=[ 2638], 95.00th=[ 2704],
     | 99.00th=[ 3589], 99.50th=[ 3949], 99.90th=[ 6194], 99.95th=[ 8717],
     | 99.99th=[11076]
   bw (  KiB/s): min=  515, max= 1598, per=68.53%, avg=1164.95, stdev=110.31, samples=59
   iops        : min=  128, max=  399, avg=290.83, stdev=27.61, samples=59
  lat (msec)   : 2=12.35%, 4=87.19%, 10=0.42%, 20=0.02%, 500=0.01%
  cpu          : usr=0.35%, sys=1.02%, ctx=12753, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12751,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
4k_randread: (groupid=1, jobs=1): err= 0: pid=6004: Mon Aug 17 14:53:17 2020
   read: IOPS=107, BW=432KiB/s (442kB/s)(12.6MiB/30006msec)
    slat (usec): min=14, max=195, avg=28.70, stdev= 8.41
    clat (usec): min=771, max=463327, avg=9230.58, stdev=14182.78
     lat (usec): min=787, max=463359, avg=9259.88, stdev=14183.32
    clat percentiles (usec):
     |  1.00th=[  1123],  5.00th=[  2671], 10.00th=[  3490], 20.00th=[  4686],
     | 30.00th=[  5669], 40.00th=[  6521], 50.00th=[  7504], 60.00th=[  8455],
     | 70.00th=[  9372], 80.00th=[ 10290], 90.00th=[ 12256], 95.00th=[ 19530],
     | 99.00th=[ 37487], 99.50th=[ 98042], 99.90th=[137364], 99.95th=[341836],
     | 99.99th=[463471]
   bw (  KiB/s): min=    7, max=  570, per=91.39%, avg=393.90, stdev=167.83, samples=59
   iops        : min=    1, max=  142, avg=98.12, stdev=42.01, samples=59
  lat (usec)   : 1000=0.53%
  lat (msec)   : 2=1.76%, 4=10.93%, 10=63.34%, 20=18.65%, 50=4.05%
  lat (msec)   : 100=0.25%, 250=0.43%, 500=0.06%
  cpu          : usr=0.15%, sys=0.40%, ctx=3238, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_write: (groupid=2, jobs=1): err= 0: pid=6005: Mon Aug 17 14:53:17 2020
  write: IOPS=368, BW=23.0MiB/s (24.2MB/s)(691MiB/30002msec)
    slat (usec): min=17, max=103, avg=21.53, stdev= 4.11
    clat (usec): min=1262, max=26190, avg=2688.41, stdev=565.48
     lat (usec): min=1282, max=26212, avg=2710.32, stdev=565.66
    clat percentiles (usec):
     |  1.00th=[ 1909],  5.00th=[ 2212], 10.00th=[ 2311], 20.00th=[ 2409],
     | 30.00th=[ 2474], 40.00th=[ 2573], 50.00th=[ 2638], 60.00th=[ 2737],
     | 70.00th=[ 2835], 80.00th=[ 2933], 90.00th=[ 2999], 95.00th=[ 3097],
     | 99.00th=[ 4424], 99.50th=[ 5473], 99.90th=[ 9503], 99.95th=[12649],
     | 99.99th=[15533]
   bw (  KiB/s): min=18129, max=21945, per=85.14%, avg=20083.54, stdev=1058.32, samples=59
   iops        : min=  283, max=  342, avg=313.29, stdev=16.55, samples=59
  lat (msec)   : 2=1.57%, 4=97.19%, 10=1.15%, 20=0.08%, 50=0.01%
  cpu          : usr=0.35%, sys=0.83%, ctx=11058, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11058,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_read: (groupid=3, jobs=1): err= 0: pid=6006: Mon Aug 17 14:53:17 2020
   read: IOPS=728, BW=45.6MiB/s (47.8MB/s)(1367MiB/30001msec)
    slat (usec): min=9, max=185, avg=19.29, stdev= 4.50
    clat (usec): min=645, max=1170.5k, avg=1349.63, stdev=10560.42
     lat (usec): min=663, max=1170.5k, avg=1369.33, stdev=10560.83
    clat percentiles (usec):
     |  1.00th=[   734],  5.00th=[   775], 10.00th=[   799], 20.00th=[   832],
     | 30.00th=[   865], 40.00th=[   898], 50.00th=[   930], 60.00th=[   988],
     | 70.00th=[  1106], 80.00th=[  1188], 90.00th=[  1303], 95.00th=[  1401],
     | 99.00th=[  8717], 99.50th=[ 10552], 99.90th=[ 16450], 99.95th=[ 89654],
     | 99.99th=[434111]
   bw (  KiB/s): min=  128, max=62976, per=100.00%, avg=47436.69, stdev=17953.98, samples=59
   iops        : min=    2, max=  984, avg=741.19, stdev=280.53, samples=59
  lat (usec)   : 750=2.40%, 1000=59.05%
  lat (msec)   : 2=36.06%, 4=0.29%, 10=1.56%, 20=0.56%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.03%
  cpu          : usr=0.57%, sys=1.62%, ctx=21868, majf=0, minf=26
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=21868,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1700KiB/s (1741kB/s), 1700KiB/s-1700KiB/s (1741kB/s-1741kB/s), io=49.8MiB (52.2MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=432KiB/s (442kB/s), 432KiB/s-432KiB/s (442kB/s-442kB/s), io=12.6MiB (13.3MB), run=30006-30006msec

Run status group 2 (all jobs):
  WRITE: bw=23.0MiB/s (24.2MB/s), 23.0MiB/s-23.0MiB/s (24.2MB/s-24.2MB/s), io=691MiB (725MB), run=30002-30002msec

Run status group 3 (all jobs):
   READ: bw=45.6MiB/s (47.8MB/s), 45.6MiB/s-45.6MiB/s (47.8MB/s-47.8MB/s), io=1367MiB (1433MB), run=30001-30001msec

Disk stats (read/write):
  rbd0: ios=25026/23833, merge=0/130, ticks=59130/60652, in_queue=93372, util=40.26%