ceph/2hdd/rbdxfs_i02.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=2
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=2
fio-3.7
Starting 4 processes

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=6014: Mon Aug 17 14:55:39 2020
  write: IOPS=1018, BW=4074KiB/s (4172kB/s)(119MiB/30001msec)
    slat (usec): min=3, max=139, avg=18.04, stdev= 8.85
    clat (usec): min=1015, max=11931, avg=1942.18, stdev=448.24
     lat (usec): min=1031, max=11970, avg=1960.61, stdev=447.98
    clat percentiles (usec):
     |  1.00th=[ 1270],  5.00th=[ 1418], 10.00th=[ 1500], 20.00th=[ 1598],
     | 30.00th=[ 1696], 40.00th=[ 1795], 50.00th=[ 1876], 60.00th=[ 1975],
     | 70.00th=[ 2089], 80.00th=[ 2245], 90.00th=[ 2442], 95.00th=[ 2606],
     | 99.00th=[ 3294], 99.50th=[ 3687], 99.90th=[ 5997], 99.95th=[ 7242],
     | 99.99th=[10028]
   bw (  KiB/s): min= 3652, max= 4402, per=98.35%, avg=4005.93, stdev=187.46, samples=59
   iops        : min=  913, max= 1100, avg=1001.12, stdev=46.84, samples=59
  lat (msec)   : 2=62.30%, 4=37.37%, 10=0.32%, 20=0.01%
  cpu          : usr=0.67%, sys=2.08%, ctx=25992, majf=0, minf=10
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,30554,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
4k_randread: (groupid=1, jobs=1): err= 0: pid=6016: Mon Aug 17 14:55:39 2020
   read: IOPS=128, BW=516KiB/s (528kB/s)(15.1MiB/30012msec)
    slat (nsec): min=6544, max=97060, avg=23121.70, stdev=9466.62
    clat (usec): min=650, max=1450.7k, avg=15483.48, stdev=55580.72
     lat (usec): min=664, max=1450.7k, avg=15507.15, stdev=55581.41
    clat percentiles (usec):
     |  1.00th=[    996],  5.00th=[   3064], 10.00th=[   4015],
     | 20.00th=[   5145], 30.00th=[   6390], 40.00th=[   7570],
     | 50.00th=[   8586], 60.00th=[   9634], 70.00th=[  10945],
     | 80.00th=[  13304], 90.00th=[  18220], 95.00th=[  28443],
     | 99.00th=[ 131597], 99.50th=[ 183501], 99.90th=[1166017],
     | 99.95th=[1451230], 99.99th=[1451230]
   bw (  KiB/s): min=    6, max=  890, per=93.39%, avg=480.95, stdev=282.90, samples=55
   iops        : min=    1, max=  222, avg=119.85, stdev=70.75, samples=55
  lat (usec)   : 750=0.16%, 1000=0.85%
  lat (msec)   : 2=0.83%, 4=8.09%, 10=52.78%, 20=29.18%, 50=4.76%
  lat (msec)   : 100=0.75%, 250=2.22%, 500=0.16%, 750=0.08%
  cpu          : usr=0.17%, sys=0.34%, ctx=3810, majf=0, minf=12
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3869,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
64k_write: (groupid=2, jobs=1): err= 0: pid=6017: Mon Aug 17 14:55:39 2020
  write: IOPS=760, BW=47.5MiB/s (49.9MB/s)(1427MiB/30003msec)
    slat (usec): min=3, max=160, avg=19.59, stdev=10.62
    clat (usec): min=1171, max=9292, avg=2606.65, stdev=429.62
     lat (usec): min=1192, max=9302, avg=2626.60, stdev=427.90
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1909], 10.00th=[ 2114], 20.00th=[ 2311],
     | 30.00th=[ 2409], 40.00th=[ 2507], 50.00th=[ 2606], 60.00th=[ 2704],
     | 70.00th=[ 2835], 80.00th=[ 2933], 90.00th=[ 3064], 95.00th=[ 3130],
     | 99.00th=[ 3949], 99.50th=[ 4293], 99.90th=[ 5211], 99.95th=[ 5997],
     | 99.99th=[ 6980]
   bw (  KiB/s): min=34696, max=51949, per=79.86%, avg=38886.02, stdev=2659.67, samples=59
   iops        : min=  542, max=  811, avg=607.12, stdev=41.58, samples=59
  lat (msec)   : 2=7.04%, 4=92.05%, 10=0.91%
  cpu          : usr=0.61%, sys=1.43%, ctx=14870, majf=0, minf=10
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22826,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
64k_read: (groupid=3, jobs=1): err= 0: pid=6018: Mon Aug 17 14:55:39 2020
   read: IOPS=1100, BW=68.8MiB/s (72.1MB/s)(2064MiB/30001msec)
    slat (usec): min=3, max=154, avg=16.20, stdev= 6.22
    clat (usec): min=497, max=1461.7k, avg=1798.19, stdev=18648.74
     lat (usec): min=504, max=1461.7k, avg=1814.73, stdev=18648.85
    clat percentiles (usec):
     |  1.00th=[    644],  5.00th=[    668], 10.00th=[    685],
     | 20.00th=[    709], 30.00th=[    725], 40.00th=[    742],
     | 50.00th=[    758], 60.00th=[    775], 70.00th=[    799],
     | 80.00th=[    840], 90.00th=[    963], 95.00th=[   3556],
     | 99.00th=[  14484], 99.50th=[  20317], 99.90th=[ 126354],
     | 99.95th=[ 135267], 99.99th=[1451230]
   bw (  KiB/s): min=  256, max=134016, per=100.00%, avg=75471.46, stdev=27882.58, samples=56
   iops        : min=    4, max= 2094, avg=1179.21, stdev=435.66, samples=56
  lat (usec)   : 500=0.01%, 750=47.23%, 1000=43.49%
  lat (msec)   : 2=4.02%, 4=0.35%, 10=2.57%, 20=1.82%, 50=0.18%
  lat (msec)   : 100=0.08%, 250=0.24%, 1000=0.01%
  cpu          : usr=0.67%, sys=2.10%, ctx=33014, majf=0, minf=43
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=33023,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=4074KiB/s (4172kB/s), 4074KiB/s-4074KiB/s (4172kB/s-4172kB/s), io=119MiB (125MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=516KiB/s (528kB/s), 516KiB/s-516KiB/s (528kB/s-528kB/s), io=15.1MiB (15.8MB), run=30012-30012msec

Run status group 2 (all jobs):
  WRITE: bw=47.5MiB/s (49.9MB/s), 47.5MiB/s-47.5MiB/s (49.9MB/s-49.9MB/s), io=1427MiB (1496MB), run=30003-30003msec

Run status group 3 (all jobs):
   READ: bw=68.8MiB/s (72.1MB/s), 68.8MiB/s-68.8MiB/s (72.1MB/s-72.1MB/s), io=2064MiB (2164MB), run=30001-30001msec

Disk stats (read/write):
  rbd0: ios=36766/53412, merge=0/289, ticks=118946/117180, in_queue=181929, util=41.25%